#Область ОбработчикиСобытийФормы

&НаКлиенте
Процедура ПутьПапкиОбработкаВыбора(Элемент, ВыбранноеЗначение, ДополнительныеДанные, ВыборДобавлением, СтандартнаяОбработка)
	
КонецПроцедуры

&НаКлиенте
Процедура ПутьПапкиНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.ВыборКаталога);
	Диалог.МножественныйВыбор = Ложь;
	ДеревоКаталогов = Новый Структура;
	Если Диалог.Выбрать() Тогда
		Каталог = Диалог.Каталог;
		ВыбратьФайлыСервер(Каталог);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ВыбратьФайлыСервер(Каталог)
	МассивФайлов = НайтиФайлы(Каталог,"*.json");
	СтруктураТаблиц = Новый Структура();
	Родитель = Неопределено;
	Для Каждого _Файл Из МассивФайлов Цикл
		ИмяТаблицы = _Файл.ИмяБезРасширения;
		МассивИмен = СтрРазделить(ИмяТаблицы, "_");
		ИмяТаблицы = МассивИмен[0];
		Если СтруктураТаблиц.Свойство(ИмяТаблицы,Родитель) Тогда
			Ветка = Родитель;
		Иначе
			Ветка = Новый Структура();
		КонецЕсли;
		Ветка.Вставить(МассивИмен[1],_Файл.ПолноеИмя);
		СтруктураТаблиц.Вставить(ИмяТаблицы,Ветка);
	КонецЦикла;
	
	Для Каждого СтруктураРодитель Из СтруктураТаблиц Цикл
		Для Каждого КлючЗначение Из СтруктураРодитель.Значение Цикл
			Ключ = КлючЗначение.Ключ;
			//ТекстДок = Новый ТекстовыйДокумент();
			//ТекстДок.Прочитать(КлючЗначение.Значение,КодировкаТекста.UTF8);
			//Струк = ПрочитатьДж(КлючЗначение.Значение);
			СтруктураРодитель.Значение.Вставить(Ключ,ПрочитатьДж(КлючЗначение.Значение));
			//СтруктураРодитель.Значение.Вставить(Ключ,ПрочитатьCSVвТЗ(КлючЗначение.Значение,",",Ложь));
			//КлючЗначение.Значение = ТекстДок.ПолучитьТекст();
		КонецЦикла;
	КонецЦикла;

КонецПроцедуры






#КонецОбласти 

#Область Служебные


&НаСервере
Функция ПрочитатьДж(ИмяФайла)
	
	ЧтениеДж = Новый ЧтениеJSON();
	ЧтениеДж.ОткрытьФайл(ИмяФайла);
	Попытка
		Структура = ПрочитатьJSON(ЧтениеДж,Ложь);
	Исключение
		//@skip-check object-deprecated
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Ошибка чтения, файл - "+СокрЛП(ИмяФайла));	
	КонецПопытки;
	
	ЧтениеДж.Закрыть();
	
	ТаблЗн = Новый ТаблицаЗначений;	
	
	Для Каждого МассивСтроки Из Структура Цикл
		
		Для Каждого СтрокаМассива из МассивСтроки.Значение Цикл
		
			Для Каждого Стр Из СтрокаМассива Цикл
				
				Если ТаблЗн.Колонки.Найти(Стр.Ключ) = Неопределено Тогда
					ТаблЗн.Колонки.Добавить(Стр.Ключ);
				КонецЕсли;
				
				НоваяСтрока = ТаблЗн.Добавить();
				НоваяСтрока.Установить(ТаблЗн.Индекс(НоваяСтрока),Стр.Значение);
				
			КонецЦикла;
		
		КонецЦикла;
		
	КонецЦикла;
	
	Возврат ТаблЗн		
КонецФункции

&НаСервере
Функция ПрочитатьCSVвТЗ(ИмяФайла, ИспользуемыйРазделитель=";", ЗаголовкиИзПервойСтроки = Ложь)

   Текст = Новый ЧтениеТекста(ИмяФайла,КодировкаТекста.UTF8);
   ТЗ = Новый ТаблицаЗначений;

   // Создадим колонки
   ТекСтрока = Текст.ПрочитатьСтроку();
   Если ТекСтрока <> Неопределено Тогда
       МассивCSV = СтрРазделить(ТекСтрока, ИспользуемыйРазделитель);
       ИндексКолонки = 0;
       Для Каждого ИмяКолонки Из МассивCSV Цикл
           ИмяКолонки = ?(ЗаголовкиИзПервойСтроки, "Кол"+ИндексКолонки, ИмяКолонки);
           ИмяКолонки = СтрЗаменить(ИмяКолонки,Символ(34),"");
           ТЗ.Колонки.Добавить(ИмяКолонки);
           ИндексКолонки = ИндексКолонки + 1;
       КонецЦикла;
       //Если ЗаголовкиИзПервойСтроки Тогда
           ТекСтрока = Текст.ПрочитатьСтроку();
       //КонецЕсли;
   КонецЕсли;

   Пока ТекСтрока <> Неопределено Цикл // строки читаются до символа перевода строки
       НоваяСтрока = ТЗ.Добавить();

       МассивCSV = СтрРазделить(ТекСтрока, ИспользуемыйРазделитель);
       ИндексКолонки = 0;
       Для Каждого СтрокаНом Из МассивCSV Цикл
           НоваяСтрока.Установить(ИндексКолонки, СтрЗаменить(СтрокаНом,Символ(34),""));
           ИндексКолонки = ИндексКолонки + 1;
       КонецЦикла;

       ТекСтрока = Текст.ПрочитатьСтроку();
   КонецЦикла;

   Возврат ТЗ;

КонецФункции



#КонецОбласти

