#Область ОбработчикиСобытийФормы

&НаКлиенте
Процедура ПутьПапкиОбработкаВыбора(Элемент, ВыбранноеЗначение, ДополнительныеДанные, ВыборДобавлением, СтандартнаяОбработка)
	
КонецПроцедуры

&НаКлиенте
Процедура ПутьПапкиНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.ВыборКаталога);
	Диалог.МножественныйВыбор = Ложь;
	ДеревоКаталогов = Новый Структура;
	Если Диалог.Выбрать() Тогда
		Каталог = Диалог.Каталог;
		ВыбратьФайлыСервер(Каталог);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ВыбратьФайлыСервер(Каталог)
	МассивФайлов = НайтиФайлы(Каталог,"*.csv");
	СтруктураТаблиц = Новый Структура();
	Родитель = Неопределено;
	Для Каждого _Файл Из МассивФайлов Цикл
		ИмяТаблицы = _Файл.ИмяБезРасширения;
		МассивИмен = СтрРазделить(ИмяТаблицы, "_");
		ИмяТаблицы = МассивИмен[0];
		Если СтруктураТаблиц.Свойство(ИмяТаблицы,Родитель) Тогда
			Ветка = Родитель;
		Иначе
			Ветка = Новый Структура();
		КонецЕсли;
		Ветка.Вставить(МассивИмен[1],_Файл.ПолноеИмя);
		СтруктураТаблиц.Вставить(ИмяТаблицы,Ветка);
	КонецЦикла;
	
	Для Каждого СтруктураРодитель Из СтруктураТаблиц Цикл
		Для Каждого КлючЗначение Из СтруктураРодитель.Значение Цикл
			Ключ = КлючЗначение.Ключ;
			ТекстДок = Новый ТекстовыйДокумент();
			ТекстДок.Прочитать(КлючЗначение.Значение,КодировкаТекста.UTF8);
			СтруктураРодитель.Значение.Вставить(Ключ,ПрочитатьCSVвТЗ(КлючЗначение.Значение,",",Ложь));
			//КлючЗначение.Значение = ТекстДок.ПолучитьТекст();
		КонецЦикла;
	КонецЦикла;

КонецПроцедуры

&НаСервере
Функция ПрочитатьCSVвТЗ(ИмяФайла, ИспользуемыйРазделитель=";", ЗаголовкиИзПервойСтроки = Ложь)

   Текст = Новый ЧтениеТекста(ИмяФайла);
   ТЗ = Новый ТаблицаЗначений;

   // Создадим колонки
   ТекСтрока = Текст.ПрочитатьСтроку();
   Если ТекСтрока <> Неопределено Тогда
       МассивCSV = СтрРазделить(ТекСтрока, ИспользуемыйРазделитель);
       ИндексКолонки = 0;
       Для Каждого ИмяКолонки Из МассивCSV Цикл
           ИмяКолонки = ?(ЗаголовкиИзПервойСтроки, "Кол"+ИндексКолонки, ИмяКолонки);
           ТЗ.Колонки.Добавить(ИмяКолонки);
           ИндексКолонки = ИндексКолонки + 1;
       КонецЦикла;
       Если ЗаголовкиИзПервойСтроки Тогда
           ТекСтрока = Текст.ПрочитатьСтроку();
       КонецЕсли;
   КонецЕсли;

   Пока ТекСтрока <> Неопределено Цикл // строки читаются до символа перевода строки
       НоваяСтрока = ТЗ.Добавить();

       МассивCSV = СтрРазделить(ТекСтрока, ИспользуемыйРазделитель);
       ИндексКолонки = 0;
       Для Каждого СтрокаНом Из МассивCSV Цикл
           НоваяСтрока[ИндексКолонки] = СтрокаНом;
           ИндексКолонки = ИндексКолонки + 1;
       КонецЦикла;

       ТекСтрока = Текст.ПрочитатьСтроку();
   КонецЦикла;

   Возврат ТЗ;

КонецФункции



#КонецОбласти 
