#Область ОбработчикиСобытийФормы

&НаКлиенте
Процедура ПутьПапкиОбработкаВыбора(Элемент, ВыбранноеЗначение, ДополнительныеДанные, ВыборДобавлением, СтандартнаяОбработка)
	
КонецПроцедуры

&НаКлиенте
Процедура ПутьПапкиНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.ВыборКаталога);
	Диалог.МножественныйВыбор = Ложь;
	ДеревоКаталогов = Новый Структура;
	Если Диалог.Выбрать() Тогда
		Каталог = Диалог.Каталог;
		ВыбратьФайлыСервер(Каталог);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ВыбратьФайлыСервер(Каталог)
	МассивФайлов = НайтиФайлы(Каталог,"*.csv");
	СтруктураТаблиц = Новый Структура();
	Родитель = Неопределено;
	Для Каждого _Файл Из МассивФайлов Цикл
		ИмяТаблицы = _Файл.ИмяБезРасширения;
		МассивИмен = СтрРазделить(ИмяТаблицы, "_");
		ИмяТаблицы = МассивИмен[0];
		Если СтруктураТаблиц.Свойство(ИмяТаблицы,Родитель) Тогда
			Ветка = Родитель;
		Иначе
			Ветка = Новый Структура();
			СтруктураТаблиц.Вставить(ИмяТаблицы,Ветка);
		КонецЕсли;			
	КонецЦикла;

КонецПроцедуры


#КонецОбласти 
