#Область ОбработчикиСобытийФормы

&НаКлиенте
Процедура ПутьПапкиОбработкаВыбора(Элемент, ВыбранноеЗначение, ДополнительныеДанные, ВыборДобавлением, СтандартнаяОбработка)
	
КонецПроцедуры

&НаКлиенте
Процедура ПутьПапкиНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.ВыборКаталога);
	Диалог.МножественныйВыбор = Ложь;
	Если Диалог.Выбрать() Тогда
		Каталог = Диалог.Каталог;
		МассивКатлогов = НайтиФайлы(Каталог,"*");
	КонецЕсли;
КонецПроцедуры


#КонецОбласти 
