
&НаКлиенте
Процедура ПутьПапкиНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.ВыборКаталога);
	Диалог.МножественныйВыбор = Ложь;
	Если Диалог.Выбрать() Тогда
		Файлы = Диалог.ВыбранныеФайлы;
		
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПутьПапкиОбработкаВыбора(Элемент, ВыбранноеЗначение, ДополнительныеДанные, ВыборДобавлением, СтандартнаяОбработка)
	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.ВыборКаталога);
	Диалог.МножественныйВыбор = Ложь;
	Если Диалог.Выбрать() Тогда
		Файлы = Диалог.ВыбранныеФайлы;
		
	КонецЕсли;
КонецПроцедуры


